# GetConnections Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..GetConnections Method
StairsRun Class See Also
---
Returns information about the connections in which the stairs run participates. The stairs run may have no connection, or have at maximum two connections at the lower and upper ends.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<StairsComponentConnection> GetConnections()
```

Visual Basic
---
```text
Public Function GetConnections As IList(Of StairsComponentConnection)
```

Visual C++
---
```text
public:
IList<StairsComponentConnection^>^ GetConnections()
```

# ### Return Value
The connections in which the stairs run participates.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace